### Datos del Titanic

In [4]:
import seaborn as sns
import pandas.util.testing as tm
import numpy as np
import pandas as pd

In [3]:
titanic = sns.load_dataset("titanic")

In [5]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Convirtiendo a factores las variables necesarias

In [7]:
titanic ['survived'] = pd.Categorical(titanic['survived'])
titanic ['pclass'] = pd.Categorical(titanic['pclass'])
titanic ['sex'] = pd.Categorical(titanic['sex'])
titanic ['sibsp'] = pd.Categorical(titanic['sibsp'])
titanic ['parch'] = pd.Categorical(titanic['parch'])
titanic ['adult_male'] = pd.Categorical(titanic['adult_male'])
titanic ['embark_town'] = pd.Categorical(titanic['embark_town'])
titanic ['alive'] = pd.Categorical(titanic['alive'])
titanic ['alone'] = pd.Categorical(titanic['alone'])
titanic ['deck'] = pd.Categorical(titanic['deck'])

# Se excluyen: class y who, porque son las mismas que pclass y sex.

### Tablas de Contingencia de una variable (Relativas)

In [21]:
tab = pd.crosstab(index = titanic["survived"],
                 columns = 'conteo')
tab

# 549 no sobrevivieron y 342 si sobrevivieron

col_0     conteo
survived
0            549
1            342

In [12]:
titanic.shape # datos coinciden

(891, 15)

In [22]:
pd.crosstab(index = titanic["pclass"], 
           columns = "conteo")

# 216 de los pasajeros iban en primera clase 
# 164 iban en segunda clase
# 491 iban en tercera clase

col_0   conteo
pclass
1          216
2          184
3          491

In [34]:
tab_s = pd.crosstab(index = titanic["sex"], 
           columns = "conteo")
tab_s

# 314 de los pasajeros eran mujeres y 577 eran hombres

col_0   conteo
sex
female     314
male       577

In [28]:
tab_c = pd.crosstab(index = titanic["deck"], 
           columns = "conteo")
tab_c

# Ojo, aqui no aparecen los "NAN"

col_0  conteo
deck
A          15
B          47
C          59
D          33
E          32
F          13
G           4

### *Hacer como ejercicio todas las demas tablas de contingencia faltantes*

In [29]:
tab_c.sum() # sabemos la clase de 203 personas

col_0
conteo    203
dtype: int64

In [31]:
tab_c.shape

(7, 1)

### Tablas de Frecuencias por valores relativos

In [33]:
tab_c / tab_c.sum() # aqui se debe hacer a mano, porque no tiene formula como en R.

col_0    conteo
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

### Proporcion de Hombres vs Mujeres

In [36]:
tab_s / tab_s.sum() # la proporcion de hombres es de un 64.75% frente a un 35.24% de mujeres, es decir,
# los hombres casi que doblaban la cantidad de pasajeros que iban en el titanic respecto a las mujeres

col_0     conteo
sex
female  0.352413
male    0.647587

### Proporcion de Supervivencia

In [38]:
tab / tab.sum() # un 62% de personas fallecieron versus un 38% que lograron vivir al naufragio.

col_0       conteo
survived
0         0.616162
1         0.383838

### *Ejercicio realizar los demas calculos relativos*

### Tablas de Contingencia para dos variables

In [42]:
survived_sex = pd.crosstab(index = titanic["survived"],
                          columns = titanic["sex"])
survived_sex.index= ["Died", "Survived"]
survived_sex

# De la poblacion en estudio:

# - 81 mujeres no sobrevivieron y 468 hombres tampoco lo hicieron.
# - 233 mujeres si sobrevivieron y solo 109 hombres salieron con vida.

sex       female  male
Died          81   468
Survived     233   109

In [47]:
survived_class = pd.crosstab(index = titanic["survived"],
                          columns = titanic["pclass"])
survived_class.index= ["Died", "Survived"]
survived_class.columns = ["First", "Second", "Third"]
survived_class

          First  Second  Third
Died         80      97    372
Survived    136      87    119

### Obteniendo las frecuencias Marginales

In [49]:
survived_class = pd.crosstab(index = titanic["survived"],
                          columns = titanic["pclass"], 
                            margins = True)
survived_class.index= ["Died", "Survived", "class_total"]
survived_class.columns = ["First", "Second", "Third", "Survived_total"]
survived_class

             First  Second  Third  Survived_total
Died            80      97    372             549
Survived       136      87    119             342
class_total    216     184    491             891

### Frecuencias relativas globales

In [57]:
round((survived_class/survived_class.loc["class_total", "Survived_total"])*100,3)

              First  Second   Third  Survived_total
Died          8.979  10.887  41.751          61.616
Survived     15.264   9.764  13.356          38.384
class_total  24.242  20.651  55.107         100.000

### Frecuencias relativas marginales

Existen dos formas de poder obtener estas frecuencias y son:

In [60]:
round(survived_class/survived_class.loc["class_total"]*100,3)
# De personas que iban en primera clase un 37% murio y un 62.96% sobrevivio y asi sucesivamente por
# cada una de las columnas

               First   Second    Third  Survived_total
Died          37.037   52.717   75.764          61.616
Survived      62.963   47.283   24.236          38.384
class_total  100.000  100.000  100.000         100.000

In [67]:
round(survived_class.div(survived_class.loc["class_total"], axis = 1)*100,3)

               First   Second    Third  Survived_total
Died          37.037   52.717   75.764          61.616
Survived      62.963   47.283   24.236          38.384
class_total  100.000  100.000  100.000         100.000

In [63]:
round(survived_class.T/survived_class["Survived_total"]*100,3) # Ojo necesito trasponer la tabla

                   Died  Survived  class_total
First            14.572    39.766       24.242
Second           17.668    25.439       20.651
Third            67.760    34.795       55.107
Survived_total  100.000   100.000      100.000

In [65]:
round(survived_class.div(survived_class["Survived_total"], axis = 0)*100,3)

              First  Second   Third  Survived_total
Died         14.572  17.668  67.760           100.0
Survived     39.766  25.439  34.795           100.0
class_total  24.242  20.651  55.107           100.0

### Tablas multi dimensionales

In [71]:
surv_sex_class = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["sex"], titanic["pclass"]],
                            margins = True)
surv_sex_class

# Ojo: estas tablas son algo mas dificiles de leer, por ello, es mejor expresarlas en graficos.

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [74]:
surv_sex_class["female"] # filtrados

pclass     1   2    3
survived
0          3   6   72
1         91  70   72
All       94  76  144

In [76]:
surv_sex_class["female"][1] # filtrados

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [78]:
surv_sex_class/surv_sex_class.loc["All"] # Frecuencia relativa global

sex         female                     male                           All
pclass           1         2    3         1         2         3
survived
0         0.031915  0.078947  0.5  0.631148  0.842593  0.864553  0.616162
1         0.968085  0.921053  0.5  0.368852  0.157407  0.135447  0.383838
All       1.000000  1.000000  1.0  1.000000  1.000000  1.000000  1.000000

### Analisis: 

En este caso se puede observar que la clase a la que pertenece una persona asi como su sexo, juegan un papel muy importante en cuanto a la supervivencia y hay una correlacion positiva alta entre ser mujer de primera y segunda clase y sobrevivir.

In [80]:
surv_class_loc = pd.crosstab(index = titanic["survived"],
                            columns = [titanic["pclass"], titanic["embark_town"]],
                            margins = True)
surv_class_loc

pclass              1                                2                         \
embark_town Cherbourg Queenstown Southampton Cherbourg Queenstown Southampton
survived
0                  26          1          53         8          1          88
1                  59          1          74         9          2          76
All                85          2         127        17          3         164

pclass              3                         All
embark_town Cherbourg Queenstown Southampton
survived
0                  41         45         286  549
1                  25         27          67  340
All                66         72         353  889

In [82]:
# Frecuencia relativa global
round((surv_class_loc/surv_class_loc.loc["All"] *100),2)

pclass              1                                2                         \
embark_town Cherbourg Queenstown Southampton Cherbourg Queenstown Southampton
survived
0               30.59       50.0       41.73     47.06      33.33       53.66
1               69.41       50.0       58.27     52.94      66.67       46.34
All            100.00      100.0      100.00    100.00     100.00      100.00

pclass              3                            All
embark_town Cherbourg Queenstown Southampton
survived
0               62.12       62.5       81.02   61.75
1               37.88       37.5       18.98   38.25
All            100.00      100.0      100.00  100.00

### Analisis:

* Se puede observar que las personas que viajaban en primera clase y provenian de Cherbourg fueron las que tuvieron la cifra mas alta de supervivencia. 
* En cuanto a las personas que viabajan en segunda clase y provenian de Queenstown fueron las que corrieron con mejor suerte. 
* Finalmente se puede observar que las personas que viajaban en tercera clase las que tuvieron mas posibilidades de salvarse provenian de Cherbourg y Queenstown. 

Nota: tanto para la segunda y tercera clase las personas que provenian de Southampton son las que tuvieron los indices mas altos de mortalidad.